{
    "content": [
        {
            "lastPosted": "null",
            "comment": "What's your name? What have you had? Reach for the lasers. Safe as fuck.",
            "URL": "https://www.youtube.com/watch?v=PQIlVIdplIc"
        },
        {
            "lastPosted": "null",
            "comment": "Its never too late, make the choices you want to make. Stay at it, never stop.",
            "URL": "https://www.youtube.com/watch?v=rz3JVZbmoCg"
        },
        {
            "lastPosted": "null",
            "comment": "Remember when you were old enough to feel strong and young enough to not know how horrible the world was?  That optimism is what this entire comp reminds me of. I wish I could go back to 1996 and make a few different choices.",
            "URL": "https://www.youtube.com/watch?v=rz3JVZbmoCg"
        },
        {
            "lastPosted": "null",
            "comment": "This is the sound of my endless journeys on rollerblades - headphones on, riding through the fields for hours and hours, occasionally greeting a cow or a fellow human, completely in sync with the music. I cannot begin to express how happy I was then. The combination of rhytmic movement and this music: Heaven!",
            "URL": "https://www.youtube.com/watch?v=h6MqY0zDUhs"
        },
        {
            "lastPosted": "null",
            "comment": "Oddly while many did drugs at raves listening to this, me and my mates used to listen to it, while setting up model railway's in our loft spaces. True story.",
            "URL": "https://www.youtube.com/watch?v=ZrLPz4QGRJ8"
        },
        {
            "lastPosted": "null",
            "comment": "Trance takes you into a 3rd person  perspective of your past, present and future. Happy, sad, distant or far, the emotions all exist in this moment which is an eternity.",
            "URL": "https://www.youtube.com/watch?v=iXAbte4QXKs"
        },
        {
            "lastPosted": "null",
            "comment": "Omg  53...and I  still bounce around like I'm a 12 year old when listening to these tunes. Hope your enjoying them as much as me. Gotta keep moving happy days everyone x",
            "URL": "https://www.youtube.com/watch?v=UwLvL49dJqU"
        },
        {
            "lastPosted": "null",
            "comment": "Ahh, takes me back to my 20's does this mix compliation. When times were easier an no life worrys... Thanks for this",
            "URL": "https://www.youtube.com/watch?v=UwLvL49dJqU"
        },
        {
            "lastPosted": "null",
            "comment": "Amazing.... So many memories from  different places, club UK,, random archers in Brixton....  lovely people and energy.... So many sweaty hugs! Gives me goosebumps.. all sums up to this mix, thank you! Been waiting for this for a long time",
            "URL": "https://www.youtube.com/watch?v=UwLvL49dJqU"
        },
        {
            "lastPosted": "null",
            "comment": "Imagine now that more than 20 years have passed since those beautiful nostalgic times. Life goes by too fast ... Yesterday's plans have a different meaning today. Greetings",
            "URL": "https://www.youtube.com/watch?v=UwLvL49dJqU"
        },
        {
            "lastPosted": "null",
            "comment": "I can leave 20 comments here and each song will have it's own memory... So I will just \"like\" and save to my playlist...Thank you uploader",
            "URL": "https://www.youtube.com/watch?v=MB0EaFehaII"
        },
        {
            "lastPosted": "null",
            "comment": "This truly takes me back to a time when I met my true family ,that I didn't know I needed, when I was never looking for one, cause I didn't know how lost I was. This was 23 years ago and families go there separate was but comeback and some never leave your side and remain a foundation in your life. The music brought us together ,but love and respect kept us together.  Love my Spy Family San Antonio TX",
            "URL": "https://www.youtube.com/watch?v=MB0EaFehaII"
        },
        {
            "lastPosted": "null",
            "comment": "LAAARGE!",
            "URL": "https://www.youtube.com/watch?v=MB0EaFehaII"
        },
        {
            "lastPosted": "null",
            "comment": "This is seriously some amazing uplifting music. I felt like I was alone, that nobody cared about me for so long but I started listening to this and it legit made me cry and realize that I have to move on. I have great friends and an amazing girlfriend now and I couldn’t be more happy. Keep the great music coming",
            "URL": "https://www.youtube.com/watch?v=iXAbte4QXKs"
        },
        {
            "lastPosted": "null",
            "comment": "Me and my Mitsubishi sometimes Dove or Rolex . Damn 90s",
            "URL": "https://www.youtube.com/watch?v=MB0EaFehaII"
        },
        {
            "lastPosted": "null",
            "comment": "im crying just now - i finally found this after 18 years",
            "URL": "https://www.youtube.com/watch?v=eS2mfeo-Ues"
        },
        {
            "lastPosted": "null",
            "comment": "This song always reminds me of my dad that passed away 10 years ago. He raised me by himself all my life because my mom passed away when I was just a baby. I have no memory of her but I do have videos and pictures and that makes me happy. All my life i aimed to make my dad proud but at the same time I was so lost and scared of losing him that I never had the courage to talk to him about life after he’s gone... he also never got to see me graduate high school and that thought never went away either. I miss you dad. I hope you and mom are proud.",
            "URL": "https://www.youtube.com/watch?v=CC5ca6Hsb2Q"
        },
        {
            "lastPosted": "null",
            "comment": "25 years ago next month I took my first trip to a rave club, got snuck in ended up finding out I am a amazing dancer to this music and still do it with the best at 43, won many dance off's back then. If you were a raver back in the day then you know what I am about to say is true, IT WAS THE GREATEST TIME EVER ON THIS PLANET, 25 years later I'm  still dancing to this music to this day and listen to it. OH the memories, people don't get it 1997-2007 was the greatest decade ever. People were so loving and caring. TRANCE will live forever!!!!!!!!! I am almost in tears listening to this music.",
            "URL": "https://www.youtube.com/watch?v=4bJ92SNa_40"
        },
        {
            "lastPosted": "null",
            "comment": "There's a reason it is called trance. Why you feel that euphoric healing in your soul when the bass and beats flow through you. Why your body craves that release. We are vibrations, and trance can set you free.",
            "URL": "https://www.youtube.com/watch?v=4bJ92SNa_40"
        },
        {
            "lastPosted": "null",
            "comment": "what's your msn addy or icq number?",
            "URL": "https://www.youtube.com/watch?v=JTqtieJBaYk"
        },
        {
            "lastPosted": "null",
            "comment": "Never been to a rave, but this takes me back to being like 14 and playing GTA III and staying up all night with my friends listening to Rise FM. This is my favorite genre of techno.",
            "URL": "https://www.youtube.com/watch?v=iSRhIeEFQf4"
        },
        {
            "lastPosted": "null",
            "comment": "Techno is for the body, trance is for the mind.",
            "URL": "https://www.youtube.com/watch?v=iSRhIeEFQf4"
        },
        {
            "lastPosted": "null",
            "comment": "The best time for trance was 1990-2010, most melodical, plenty of new sounds.. that's why most of this tracks used in \"Kevin and Perry go large\"",
            "URL": "https://www.youtube.com/watch?v=KcU-1fbhgss"
        },
        {
            "lastPosted": "null",
            "comment": "I am 73 years of age, have lived my life alone in high country or in deserts across the earth and know beyond any doubt that this is music of the utmost wonder. Beauty and madness harmonised. Listen. This is genius in its most perfect form.",
            "URL": "https://www.youtube.com/watch?v=8tIgN7eICn4"
        },
        {
            "lastPosted": "null",
            "comment": "Early 90's. Rave, techno, good times, dancing, after hours parties... no phones, no social bs media. Just pure energy, pure emotion. Blessed to live through all that with full force... and blessed i survived.",
            "URL": "https://www.youtube.com/watch?v=krN3ledny"
        },
        {
            "lastPosted": "null",
            "comment": "Every time the synth ruthlessly kicks in I still have shivers along the back of my skull and down my spine - I guess I still have the chemicals in my brain- God I miss it all - reach out to me all you ex ravers I need a hug",
            "URL": "https://www.youtube.com/watch?v=1ltoAcZrjBw"
        },
        {
            "lastPosted": "null",
            "comment": "I remember back in 1995 when Pete Tong made this his Essential New Tune. He was completely blown away by it.  Nothing at that time had ever sounded quite like this before, it was simply groundbreaking and brought new meaning to the word \"epic\".  Hearing this track reverberating around the cavernous KU (now Privilege) in Ibiza, during that summer with the roof off, gave it the stage it demanded and deserved.",
            "URL": "https://www.youtube.com/watch?v=2NXgqFbfrd8"
        },
        {
            "lastPosted": "null",
            "comment": "Epic. Takes me right back to that happy place... And I'm wishing tonight, was a Friday night. Warm summer breeze, London town, knowing I'll see the sun set, twice.",
            "URL": "https://www.youtube.com/watch?v=HP1MSjgRzzo"
        },
        {
            "lastPosted": "null",
            "comment": "Nice to go back and remember a time where I was invincible and the weight of the world would still fit in a backpack. Glad to have lived in those times and to still remember them fondly.",
            "URL": "https://www.youtube.com/watch?v=HP1MSjgRzzo"
        },
        {
            "lastPosted": "null",
            "comment": "I remember Jr dropping this and every time the drop was about to come he took the needle of the record and started it again and when it finally dropped the place went crazy. From juice heads to drag queens and everything in between it was amazing. NYC had the best house music in the 90s.",
            "URL": "https://www.youtube.com/watch?v=bvsqEFWZ9tw"
        },
        {
            "lastPosted": "null",
            "comment": "Memories of 1999, sitting watching The Box with my cousin all night. Taking turns playing Doom on the PS1 and shouting him through whenever Blue (da ba de) came on.",
            "URL": "https://www.youtube.com/watch?v=oP--4ELAVug"
        },
        {
            "lastPosted": "null",
            "comment": "I remember listening to this when it came out and my 10-year-old-self didn't really get it. It was too melancholic. Now all these years later when I lived more of my life I finally get it. Unfortunately.",
            "URL": "https://www.youtube.com/watch?v=-T6NKsPZxBA"
        },
        {
            "lastPosted": "null",
            "comment": "i can do that using wmplayer..but is a good remix after all..",
            "URL": "https://www.youtube.com/watch?v=LmRG7k69yjM"
        },
        {
            "lastPosted": "null",
            "comment": "The sun is gonna keep on shining, Brighter days on the horizon, My love for you will keep on rising, Everything's gonna be alright",
            "URL": "https://www.youtube.com/watch?v=tYNCot63qQM"
        },
        {
            "lastPosted": "null",
            "comment": "Wow.... Sometimes you have to watch these clips in time and moments in time to remember just how incredible they were.... You can almost feel and taste the energy and the togetherness that these events used to deliver...As the folk of those days always say....Whooooooshh ...  You never forget your first one.. Many thanks for the upload.",
            "URL": "https://www.youtube.com/watch?v=vyKU5t62Ja4"
        },
        {
            "lastPosted": "null",
            "comment": "So awesome our generation is finally controlling the dial and bringing back the music we want to hear. Jungle and liquid DnB was not just a fad, it was a belief in a future that was both progressive and timeless. The intricate and abstract structure of the drums layered with the fluid ambient soundscapes and relentless rolling bass rhythms ... It gave hope.",
            "URL": "https://www.youtube.com/watch?v=qXfdneeIZnw"
        },
        {
            "lastPosted": "null",
            "comment": "I love listening to this set in the night just cruising in my spaceship through empty quadrants...",
            "URL": "https://www.youtube.com/watch?v=dZ2NQ-xQINI"
        }
    ]
}
